# IFC_DMIsFieldOpt

## Description
Checks if the indicated field, from current IFC Data Mapping,  is optional.

```pascal
FUNCTION IFC_DMIsFieldOpt(
				inStrObjName   : STRING;
				inStrEntryName : STRING;
				inStrFieldName : STRING) : BOOLEAN;
```

```python

def vs.IFC_DMIsFieldOpt(inStrObjName, inStrEntryName, inStrFieldName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrObjName|STRING||
|inStrEntryName|STRING||
|inStrFieldName|STRING||

## Version
Availability: from Vectorworks 2017
## Category
* IFC